; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=67, remove_proportion=0.101, bases=26, instance_id=20, output=./training, seed=61

(define (problem warehouse-20)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 box43 box44 box45 box46 box47 box48 box49 box50 box51 box52 box53 box54 box55 box56 box57 box58 box59 box60 box61 box62 box63 box64 box65 box66 box67 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 base13 base14 base15 base16 base17 base18 base19 base20 base21 base22 base23 base24 base25 base26 - base
    )
    (:init
        (to-remove box19)
        (to-remove box21)
        (to-remove box24)
        (to-remove box28)
        (to-remove box42)
        (to-remove box64)
        (clear box58)
        (on box58 box14)
        (on box14 box53)
        (on box53 box21)
        (on box21 box3)
        (on-base box3 base1)
        (clear box49)
        (on-base box49 base2)
        (clear box65)
        (on box65 box56)
        (on box56 box17)
        (on box17 box7)
        (on-base box7 base3)
        (clear box61)
        (on-base box61 base4)
        (clear box24)
        (on box24 box47)
        (on box47 box25)
        (on-base box25 base5)
        (clear box39)
        (on box39 box48)
        (on box48 box11)
        (on box11 box60)
        (on box60 box19)
        (on-base box19 base6)
        (clear box67)
        (on-base box67 base7)
        (clear box46)
        (on-base box46 base8)
        (clear box43)
        (on-base box43 base9)
        (clear box57)
        (on box57 box28)
        (on box28 box29)
        (on-base box29 base10)
        (clear box10)
        (on box10 box12)
        (on box12 box33)
        (on box33 box31)
        (on box31 box20)
        (on-base box20 base11)
        (clear box6)
        (on box6 box63)
        (on box63 box51)
        (on box51 box35)
        (on box35 box5)
        (on-base box5 base12)
        (clear box66)
        (on box66 box27)
        (on box27 box8)
        (on box8 box55)
        (on-base box55 base13)
        (clear box44)
        (on box44 box45)
        (on box45 box22)
        (on box22 box59)
        (on-base box59 base14)
        (clear box32)
        (on box32 box9)
        (on box9 box62)
        (on-base box62 base15)
        (clear box52)
        (on box52 box4)
        (on-base box4 base16)
        (clear box15)
        (on-base box15 base17)
        (clear box54)
        (on box54 box50)
        (on-base box50 base18)
        (clear-base base19)
        (clear box42)
        (on box42 box34)
        (on-base box34 base20)
        (clear box18)
        (on box18 box37)
        (on box37 box13)
        (on box13 box38)
        (on-base box38 base21)
        (clear-base base22)
        (clear box2)
        (on box2 box16)
        (on box16 box64)
        (on box64 box41)
        (on-base box41 base23)
        (clear box26)
        (on box26 box30)
        (on-base box30 base24)
        (clear box36)
        (on-base box36 base25)
        (clear box1)
        (on box1 box40)
        (on box40 box23)
        (on-base box23 base26)
    )
    (:goal (and 
        (removed box19)
        (removed box21)
        (removed box24)
        (removed box28)
        (removed box42)
        (removed box64)
    ))
)

; plan
1. (move box2 box16 box1)
   deleted: (clear box1) (on box2 box16)
   added: (on box2 box1) (clear box16)
   goals met: 0 of 6
2. (move box16 box64 box10)
   deleted: (clear box10) (on box16 box64)
   added: (on box16 box10) (clear box64)
   goals met: 0 of 6
3. (move box39 box48 box15)
   deleted: (clear box15) (on box39 box48)
   added: (on box39 box15) (clear box48)
   goals met: 0 of 6
4. (move box48 box11 box16)
   deleted: (clear box16) (on box48 box11)
   added: (on box48 box16) (clear box11)
   goals met: 0 of 6
5. (move box11 box60 box18)
   deleted: (clear box18) (on box11 box60)
   added: (on box11 box18) (clear box60)
   goals met: 0 of 6
6. (move box57 box28 box11)
   deleted: (clear box11) (on box57 box28)
   added: (on box57 box11) (clear box28)
   goals met: 0 of 6
7. (move box58 box14 box2)
   deleted: (clear box2) (on box58 box14)
   added: (on box58 box2) (clear box14)
   goals met: 0 of 6
8. (remove box24 box47)
   deleted: (on box24 box47) (clear box24)
   added: (removed box24) (clear box47)
   goals met: 1 of 6
9. (move box14 box53 box26)
   deleted: (clear box26) (on box14 box53)
   added: (on box14 box26) (clear box53)
   goals met: 1 of 6
10. (move box53 box21 box14)
   deleted: (clear box14) (on box53 box21)
   added: (on box53 box14) (clear box21)
   goals met: 1 of 6
11. (remove box21 box3)
   deleted: (on box21 box3) (clear box21)
   added: (removed box21) (clear box3)
   goals met: 2 of 6
12. (remove box28 box29)
   deleted: (on box28 box29) (clear box28)
   added: (removed box28) (clear box29)
   goals met: 3 of 6
13. (move box60 box19 box29)
   deleted: (clear box29) (on box60 box19)
   added: (on box60 box29) (clear box19)
   goals met: 3 of 6
14. (remove-from-base box19 base6)
   deleted: (on-base box19 base6) (clear box19)
   added: (removed box19) (clear-base base6)
   goals met: 4 of 6
15. (remove box42 box34)
   deleted: (on box42 box34) (clear box42)
   added: (removed box42) (clear box34)
   goals met: 5 of 6
16. (remove box64 box41)
   deleted: (on box64 box41) (clear box64)
   added: (removed box64) (clear box41)
   goals met: 6 of 6
